Revit 2027 API
RailingPlacementPosition Enumeration
 Railing placement position.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RailingPlacementPosition
Public Enumeration RailingPlacementPosition
public enum class RailingPlacementPosition
type RailingPlacementPosition
Members
Member name | Value | Description
Stringer | 1 |  Places railing on stringer.
Treads | 0 |  Places railing on treads.
Undefined | -1 |  No railing placement.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace